Revit 2026 API

# FilteredElementIdIterator Class

---

An iterator to a set of element ids filtered by the settings of a FilteredElementCollector.

SystemObject Autodesk.Revit.DBFilteredElementIdIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilteredElementIdIterator : IEnumerator<ElementId>
```
```vb
Public Class FilteredElementIdIterator
	Implements IEnumerator(Of ElementId)
```
```cpp
public ref class FilteredElementIdIterator : IEnumerator<ElementId^>
```
```fsharp
type FilteredElementIdIterator =
    class
        interface IEnumerator<ElementId>
    end
```

The FilteredElementIdIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FilteredElementIdIterator |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCurrent | The current element id found by the iterator. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsDone | Identifies if the iteration has completed. |
|  | MoveNext | Increments the iterator to the next element id passing the filter. |
|  | Reset | Resets the iterator to the beginning. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace